GopalSaraf/Practicals/PSDL/include/proc/pic16f19196.inc
// Register: SSP1CLKPPS
#define SSP1CLKPPS SSP1CLKPPS
SSP1CLKPPS                               equ 01EC5h
// bitfield definitions
SSP1CLKPPS_SSP1CLKPPS_POSN               equ 0000h
SSP1CLKPPS_SSP1CLKPPS_POSITION           equ 0000h
SSP1CLKPPS_SSP1CLKPPS_SIZE               equ 0006h
SSP1CLKPPS_SSP1CLKPPS_LENGTH             equ 0006h
SSP1CLKPPS_SSP1CLKPPS_MASK               equ 003Fh
SSP1CLKPPS_SSP1CLKPPS0_POSN              equ 0000h
SSP1CLKPPS_SSP1CLKPPS0_POSITION          equ 0000h
SSP1CLKPPS_SSP1CLKPPS0_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS0_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS0_MASK              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_POSN              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_POSITION          equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_MASK              equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_POSN              equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_POSITION          equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS2_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS2_MASK              equ 0004h
SSP1CLKPPS_SSP1CLKPPS3_POSN              equ 0003h
SSP1CLKPPS_SSP1CLKPPS3_POSITION          equ 0003h
SSP1CLKPPS_SSP1CLKPPS3_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS3_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS3_MASK              equ 0008h
SSP1CLKPPS_SSP1CLKPPS4_POSN              equ 0004h
SSP1CLKPPS_SSP1CLKPPS4_POSITION          equ 0004h
SSP1CLKPPS_SSP1CLKPPS4_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS4_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS4_MASK              equ 0010h

// Register: SSP1DATPPS
#define SSP1DATPPS SSP1DATPPS
SSP1DATPPS                               equ 01EC6h
// bitfield definitions
SSP1DATPPS_SSP1DATPPS_POSN               equ 0000h
SSP1DATPPS_SSP1DATPPS_POSITION           equ 0000h
SSP1DATPPS_SSP1DATPPS_SIZE               equ 0006h
SSP1DATPPS_SSP1DATPPS_LENGTH             equ 0006h
SSP1DATPPS_SSP1DATPPS_MASK               equ 003Fh
SSP1DATPPS_SSP1DATPPS0_POSN              equ 0000h
SSP1DATPPS_SSP1DATPPS0_POSITION          equ 0000h
SSP1DATPPS_SSP1DATPPS0_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS0_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS0_MASK              equ 0001h
SSP1DATPPS_SSP1DATPPS1_POSN              equ 0001h
SSP1DATPPS_SSP1DATPPS1_POSITION          equ 0001h
SSP1DATPPS_SSP1DATPPS1_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS1_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS1_MASK              equ 0002h
SSP1DATPPS_SSP1DATPPS2_POSN              equ 0002h
SSP1DATPPS_SSP1DATPPS2_POSITION          equ 0002h
SSP1DATPPS_SSP1DATPPS2_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS2_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS2_MASK              equ 0004h
SSP1DATPPS_SSP1DATPPS3_POSN              equ 0003h
SSP1DATPPS_SSP1DATPPS3_POSITION          equ 0003h
SSP1DATPPS_SSP1DATPPS3_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS3_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS3_MASK              equ 0008h
SSP1DATPPS_SSP1DATPPS4_POSN              equ 0004h
SSP1DATPPS_SSP1DATPPS4_POSITION          equ 0004h
SSP1DATPPS_SSP1DATPPS4_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS4_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS4_MASK              equ 0010h

// Register: SSP1SSPPS
#define SSP1SSPPS SSP1SSPPS
SSP1SSPPS                                equ 01EC7h
// bitfield definitions
SSP1SSPPS_SSP1SSPPS_POSN                 equ 0000h
SSP1SSPPS_SSP1SSPPS_POSITION             equ 0000h
SSP1SSPPS_SSP1SSPPS_SIZE                 equ 0006h
SSP1SSPPS_SSP1SSPPS_LENGTH               equ 0006h
SSP1SSPPS_SSP1SSPPS_MASK                 equ 003Fh
SSP1SSPPS_SSP1SSPPS0_POSN                equ 0000h
SSP1SSPPS_SSP1SSPPS0_POSITION            equ 0000h
SSP1SSPPS_SSP1SSPPS0_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS0_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS0_MASK                equ 0001h
SSP1SSPPS_SSP1SSPPS1_POSN                equ 0001h
SSP1SSPPS_SSP1SSPPS1_POSITION            equ 0001h
SSP1SSPPS_SSP1SSPPS1_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS1_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS1_MASK                equ 0002h
SSP1SSPPS_SSP1SSPPS2_POSN                equ 0002h
SSP1SSPPS_SSP1SSPPS2_POSITION            equ 0002h
SSP1SSPPS_SSP1SSPPS2_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS2_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS2_MASK                equ 0004h
SSP1SSPPS_SSP1SSPPS3_POSN                equ 0003h
SSP1SSPPS_SSP1SSPPS3_POSITION            equ 0003h
SSP1SSPPS_SSP1SSPPS3_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS3_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS3_MASK                equ 0008h
SSP1SSPPS_SSP1SSPPS4_POSN                equ 0004h
SSP1SSPPS_SSP1SSPPS4_POSITION            equ 0004h
SSP1SSPPS_SSP1SSPPS4_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS4_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS4_MASK                equ 0010h

// Register: RX1PPS
#define RX1PPS RX1PPS
RX1PPS                                   equ 01ECBh
// bitfield definitions
RX1PPS_RX1PPS_POSN                       equ 0000h
RX1PPS_RX1PPS_POSITION                   equ 0000h
RX1PPS_RX1PPS_SIZE                       equ 0006h
RX1PPS_RX1PPS_LENGTH                     equ 0006h
RX1PPS_RX1PPS_MASK                       equ 003Fh
RX1PPS_RX1PPS0_POSN                      equ 0000h
RX1PPS_RX1PPS0_POSITION                  equ 0000h
RX1PPS_RX1PPS0_SIZE                      equ 0001h
RX1PPS_RX1PPS0_LENGTH                    equ 0001h
RX1PPS_RX1PPS0_MASK                      equ 0001h
RX1PPS_RX1PPS1_POSN                      equ 0001h
RX1PPS_RX1PPS1_POSITION                  equ 0001h
RX1PPS_RX1PPS1_SIZE                      equ 0001h
RX1PPS_RX1PPS1_LENGTH                    equ 0001h
RX1PPS_RX1PPS1_MASK                      equ 0002h
RX1PPS_RX1PPS2_POSN                      equ 0002h
RX1PPS_RX1PPS2_POSITION                  equ 0002h
RX1PPS_RX1PPS2_SIZE                      equ 0001h
RX1PPS_RX1PPS2_LENGTH                    equ 0001h
RX1PPS_RX1PPS2_MASK                      equ 0004h
RX1PPS_RX1PPS3_POSN                      equ 0003h
RX1PPS_RX1PPS3_POSITION                  equ 0003h
RX1PPS_RX1PPS3_SIZE                      equ 0001h
RX1PPS_RX1PPS3_LENGTH                    equ 0001h
RX1PPS_RX1PPS3_MASK                      equ 0008h
RX1PPS_RX1PPS4_POSN                      equ 0004h
RX1PPS_RX1PPS4_POSITION                  equ 0004h
RX1PPS_RX1PPS4_SIZE                      equ 0001h
RX1PPS_RX1PPS4_LENGTH                    equ 0001h
RX1PPS_RX1PPS4_MASK                      equ 0010h

// Register: TX1PPS
#define TX1PPS TX1PPS
TX1PPS                                   equ 01ECCh
// bitfield definitions
TX1PPS_TX1PPS_POSN                       equ 0000h
TX1PPS_TX1PPS_POSITION                   equ 0000h
TX1PPS_TX1PPS_SIZE                       equ 0006h
TX1PPS_TX1PPS_LENGTH                     equ 0006h
TX1PPS_TX1PPS_MASK                       equ 003Fh
TX1PPS_TX1PPS0_POSN                      equ 0000h
TX1PPS_TX1PPS0_POSITION                  equ 0000h
TX1PPS_TX1PPS0_SIZE                      equ 0001h
TX1PPS_TX1PPS0_LENGTH                    equ 0001h
TX1PPS_TX1PPS0_MASK                      equ 0001h
TX1PPS_TX1PPS1_POSN                      equ 0001h
TX1PPS_TX1PPS1_POSITION                  equ 0001h
TX1PPS_TX1PPS1_SIZE                      equ 0001h
TX1PPS_TX1PPS1_LENGTH                    equ 0001h
TX1PPS_TX1PPS1_MASK                      equ 0002h
TX1PPS_TX1PPS2_POSN                      equ 0002h
TX1PPS_TX1PPS2_POSITION                  equ 0002h
TX1PPS_TX1PPS2_SIZE                      equ 0001h
TX1PPS_TX1PPS2_LENGTH                    equ 0001h
TX1PPS_TX1PPS2_MASK                      equ 0004h
TX1PPS_TX1PPS3_POSN                      equ 0003h
TX1PPS_TX1PPS3_POSITION                  equ 0003h
TX1PPS_TX1PPS3_SIZE                      equ 0001h
TX1PPS_TX1PPS3_LENGTH                    equ 0001h
TX1PPS_TX1PPS3_MASK                      equ 0008h
TX1PPS_TX1PPS4_POSN                      equ 0004h
TX1PPS_TX1PPS4_POSITION                  equ 0004h
TX1PPS_TX1PPS4_SIZE                      equ 0001h
TX1PPS_TX1PPS4_LENGTH                    equ 0001h
TX1PPS_TX1PPS4_MASK                      equ 0010h

// Register: RX2PPS
#define RX2PPS RX2PPS
RX2PPS                                   equ 01ECDh
// bitfield definitions
RX2PPS_RX2PPS_POSN                       equ 0000h
RX2PPS_RX2PPS_POSITION                   equ 0000h
RX2PPS_RX2PPS_SIZE                       equ 0006h
RX2PPS_RX2PPS_LENGTH                     equ 0006h
RX2PPS_RX2PPS_MASK                       equ 003Fh
RX2PPS_RX2PPS0_POSN                      equ 0000h
RX2PPS_RX2PPS0_POSITION                  equ 0000h
RX2PPS_RX2PPS0_SIZE                      equ 0001h
RX2PPS_RX2PPS0_LENGTH                    equ 0001h
RX2PPS_RX2PPS0_MASK                      equ 0001h
RX2PPS_RX2PPS1_POSN                      equ 0001h
RX2PPS_RX2PPS1_POSITION                  equ 0001h
RX2PPS_RX2PPS1_SIZE                      equ 0001h
RX2PPS_RX2PPS1_LENGTH                    equ 0001h
RX2PPS_RX2PPS1_MASK                      equ 0002h
RX2PPS_RX2PPS2_POSN                      equ 0002h
RX2PPS_RX2PPS2_POSITION                  equ 0002h
RX2PPS_RX2PPS2_SIZE                      equ 0001h
RX2PPS_RX2PPS2_LENGTH                    equ 0001h
RX2PPS_RX2PPS2_MASK                      equ 0004h
RX2PPS_RX2PPS3_POSN                      equ 0003h
RX2PPS_RX2PPS3_POSITION                  equ 0003h
RX2PPS_RX2PPS3_SIZE                      equ 0001h
RX2PPS_RX2PPS3_LENGTH                    equ 0001h
RX2PPS_RX2PPS3_MASK                      equ 0008h
RX2PPS_RX2PPS4_POSN                      equ 0004h
RX2PPS_RX2PPS4_POSITION                  equ 0004h
RX2PPS_RX2PPS4_SIZE                      equ 0001h
RX2PPS_RX2PPS4_LENGTH                    equ 0001h
RX2PPS_RX2PPS4_MASK                      equ 0010h

// Register: TX2PPS
#define TX2PPS TX2PPS
TX2PPS                                   equ 01ECEh
// bitfield definitions
TX2PPS_TX2PPS_POSN                       equ 0000h
TX2PPS_TX2PPS_POSITION                   equ 0000h
TX2PPS_TX2PPS_SIZE                       equ 0006h
TX2PPS_TX2PPS_LENGTH                     equ 0006h
TX2PPS_TX2PPS_MASK                       equ 003Fh
TX2PPS_TX2PPS0_POSN                      equ 0000h
TX2PPS_TX2PPS0_POSITION                  equ 0000h
TX2PPS_TX2PPS0_SIZE                      equ 0001h
TX2PPS_TX2PPS0_LENGTH                    equ 0001h
TX2PPS_TX2PPS0_MASK                      equ 0001h
TX2PPS_TX2PPS1_POSN                      equ 0001h
TX2PPS_TX2PPS1_POSITION                  equ 0001h
TX2PPS_TX2PPS1_SIZE                      equ 0001h
TX2PPS_TX2PPS1_LENGTH                    equ 0001h
TX2PPS_TX2PPS1_MASK                      equ 0002h
TX2PPS_TX2PPS2_POSN                      equ 0002h
TX2PPS_TX2PPS2_POSITION                  equ 0002h
TX2PPS_TX2PPS2_SIZE                      equ 0001h
TX2PPS_TX2PPS2_LENGTH                    equ 0001h
TX2PPS_TX2PPS2_MASK                      equ 0004h
TX2PPS_TX2PPS3_POSN                      equ 0003h
TX2PPS_TX2PPS3_POSITION                  equ 0003h
TX2PPS_TX2PPS3_SIZE                      equ 0001h
TX2PPS_TX2PPS3_LENGTH                    equ 0001h
TX2PPS_TX2PPS3_MASK                      equ 0008h
TX2PPS_TX2PPS4_POSN                      equ 0004h
TX2PPS_TX2PPS4_POSITION                  equ 0004h
TX2PPS_TX2PPS4_SIZE                      equ 0001h
TX2PPS_TX2PPS4_LENGTH                    equ 0001h
TX2PPS_TX2PPS4_MASK                      equ 0010h

// Register: RA0PPS
#define RA0PPS RA0PPS
RA0PPS                                   equ 01F10h
// bitfield definitions
RA0PPS_RA0PPS0_POSN                      equ 0000h
RA0PPS_RA0PPS0_POSITION                  equ 0000h
RA0PPS_RA0PPS0_SIZE                      equ 0001h
RA0PPS_RA0PPS0_LENGTH                    equ 0001h
RA0PPS_RA0PPS0_MASK                      equ 0001h
RA0PPS_RA0PPS1_POSN                      equ 0001h
RA0PPS_RA0PPS1_POSITION                  equ 0001h
RA0PPS_RA0PPS1_SIZE                      equ 0001h
RA0PPS_RA0PPS1_LENGTH                    equ 0001h
RA0PPS_RA0PPS1_MASK                      equ 0002h
RA0PPS_RA0PPS2_POSN                      equ 0002h
RA0PPS_RA0PPS2_POSITION                  equ 0002h
RA0PPS_RA0PPS2_SIZE                      equ 0001h
RA0PPS_RA0PPS2_LENGTH                    equ 0001h
RA0PPS_RA0PPS2_MASK                      equ 0004h
RA0PPS_RA0PPS3_POSN                      equ 0003h
RA0PPS_RA0PPS3_POSITION                  equ 0003h
RA0PPS_RA0PPS3_SIZE                      equ 0001h
RA0PPS_RA0PPS3_LENGTH                    equ 0001h
RA0PPS_RA0PPS3_MASK                      equ 0008h
RA0PPS_RA0PPS4_POSN                      equ 0004h
RA0PPS_RA0PPS4_POSITION                  equ 0004h
RA0PPS_RA0PPS4_SIZE                      equ 0001h
RA0PPS_RA0PPS4_LENGTH                    equ 0001h
RA0PPS_RA0PPS4_MASK                      equ 0010h
RA0PPS_RA0PPS5_POSN                      equ 0005h
RA0PPS_RA0PPS5_POSITION                  equ 0005h
RA0PPS_RA0PPS5_SIZE                      equ 0001h
RA0PPS_RA0PPS5_LENGTH                    equ 0001h
RA0PPS_RA0PPS5_MASK                      equ 0020h

// Register: RA1PPS
#define RA1PPS RA1PPS
RA1PPS                                   equ 01F11h
// bitfield definitions
RA1PPS_RA1PPS0_POSN                      equ 0000h
RA1PPS_RA1PPS0_POSITION                  equ 0000h
RA1PPS_RA1PPS0_SIZE                      equ 0001h
RA1PPS_RA1PPS0_LENGTH                    equ 0001h
RA1PPS_RA1PPS0_MASK                      equ 0001h
RA1PPS_RA1PPS1_POSN                      equ 0001h
RA1PPS_RA1PPS1_POSITION                  equ 0001h
RA1PPS_RA1PPS1_SIZE                      equ 0001h
RA1PPS_RA1PPS1_LENGTH                    equ 0001h
RA1PPS_RA1PPS1_MASK                      equ 0002h
RA1PPS_RA1PPS2_POSN                      equ 0002h
RA1PPS_RA1PPS2_POSITION                  equ 0002h
RA1PPS_RA1PPS2_SIZE                      equ 0001h
RA1PPS_RA1PPS2_LENGTH                    equ 0001h
RA1PPS_RA1PPS2_MASK                      equ 0004h
RA1PPS_RA1PPS3_POSN                      equ 0003h
RA1PPS_RA1PPS3_POSITION                  equ 0003h
RA1PPS_RA1PPS3_SIZE                      equ 0001h
RA1PPS_RA1PPS3_LENGTH                    equ 0001h
RA1PPS_RA1PPS3_MASK                      equ 0008h
RA1PPS_RA1PPS4_POSN                      equ 0004h
RA1PPS_RA1PPS4_POSITION                  equ 0004h
RA1PPS_RA1PPS4_SIZE                      equ 0001h
RA1PPS_RA1PPS4_LENGTH                    equ 0001h
RA1PPS_RA1PPS4_MASK                      equ 0010h
RA1PPS_RA1PPS5_POSN                      equ 0005h
RA1PPS_RA1PPS5_POSITION                  equ 0005h
RA1PPS_RA1PPS5_SIZE                      equ 0001h
RA1PPS_RA1PPS5_LENGTH                    equ 0001h
RA1PPS_RA1PPS5_MASK                      equ 0020h

// Register: RA2PPS
#define RA2PPS RA2PPS
RA2PPS                                   equ 01F12h
// bitfield definitions
RA2PPS_RA2PPS0_POSN                      equ 0000h
RA2PPS_RA2PPS0_POSITION                  equ 0000h
RA2PPS_RA2PPS0_SIZE                      equ 0001h
RA2PPS_RA2PPS0_LENGTH                    equ 0001h
RA2PPS_RA2PPS0_MASK                      equ 0001h
RA2PPS_RA2PPS1_POSN                      equ 0001h
RA2PPS_RA2PPS1_POSITION                  equ 0001h
RA2PPS_RA2PPS1_SIZE                      equ 0001h
RA2PPS_RA2PPS1_LENGTH                    equ 0001h
RA2PPS_RA2PPS1_MASK                      equ 0002h
RA2PPS_RA2PPS2_POSN                      equ 0002h
RA2PPS_RA2PPS2_POSITION                  equ 0002h
RA2PPS_RA2PPS2_SIZE                      equ 0001h
RA2PPS_RA2PPS2_LENGTH                    equ 0001h
RA2PPS_RA2PPS2_MASK                      equ 0004h
RA2PPS_RA2PPS3_POSN                      equ 0003h
RA2PPS_RA2PPS3_POSITION                  equ 0003h
RA2PPS_RA2PPS3_SIZE                      equ 0001h
RA2PPS_RA2PPS3_LENGTH                    equ 0001h
RA2PPS_RA2PPS3_MASK                      equ 0008h
RA2PPS_RA2PPS4_POSN                      equ 0004h
RA2PPS_RA2PPS4_POSITION                  equ 0004h
RA2PPS_RA2PPS4_SIZE                      equ 0001h
RA2PPS_RA2PPS4_LENGTH                    equ 0001h
RA2PPS_RA2PPS4_MASK                      equ 0010h
RA2PPS_RA2PPS5_POSN                      equ 0005h
RA2PPS_RA2PPS5_POSITION                  equ 0005h
RA2PPS_RA2PPS5_SIZE                      equ 0001h
RA2PPS_RA2PPS5_LENGTH                    equ 0001h
RA2PPS_RA2PPS5_MASK                      equ 0020h

