GopalSaraf/Practicals/PSDL/include/proc/pic16f19196.inc
#define S33C4                            BANKMASK(LCDDATA28), 1
#define S33C5                            BANKMASK(LCDDATA34), 1
#define S33C6                            BANKMASK(LCDDATA40), 1
#define S33C7                            BANKMASK(LCDDATA46), 1
#define S34C0                            BANKMASK(LCDDATA4), 2
#define S34C1                            BANKMASK(LCDDATA10), 2
#define S34C2                            BANKMASK(LCDDATA16), 2
#define S34C3                            BANKMASK(LCDDATA22), 2
#define S34C4                            BANKMASK(LCDDATA28), 2
#define S34C5                            BANKMASK(LCDDATA34), 2
#define S34C6                            BANKMASK(LCDDATA40), 2
#define S34C7                            BANKMASK(LCDDATA46), 2
#define S35C0                            BANKMASK(LCDDATA4), 3
#define S35C1                            BANKMASK(LCDDATA10), 3
#define S35C2                            BANKMASK(LCDDATA16), 3
#define S35C3                            BANKMASK(LCDDATA22), 3
#define S35C4                            BANKMASK(LCDDATA28), 3
#define S35C5                            BANKMASK(LCDDATA34), 3
#define S35C6                            BANKMASK(LCDDATA40), 3
#define S35C7                            BANKMASK(LCDDATA46), 3
#define S36C0                            BANKMASK(LCDDATA4), 4
#define S36C1                            BANKMASK(LCDDATA10), 4
#define S36C2                            BANKMASK(LCDDATA16), 4
#define S36C3                            BANKMASK(LCDDATA22), 4
#define S36C4                            BANKMASK(LCDDATA28), 4
#define S36C5                            BANKMASK(LCDDATA34), 4
#define S36C6                            BANKMASK(LCDDATA40), 4
#define S36C7                            BANKMASK(LCDDATA46), 4
#define S37C0                            BANKMASK(LCDDATA4), 5
#define S37C1                            BANKMASK(LCDDATA10), 5
#define S37C2                            BANKMASK(LCDDATA16), 5
#define S37C3                            BANKMASK(LCDDATA22), 5
#define S37C4                            BANKMASK(LCDDATA28), 5
#define S37C5                            BANKMASK(LCDDATA34), 5
#define S37C6                            BANKMASK(LCDDATA40), 5
#define S37C7                            BANKMASK(LCDDATA46), 5
#define S38C0                            BANKMASK(LCDDATA4), 6
#define S38C1                            BANKMASK(LCDDATA10), 6
#define S38C2                            BANKMASK(LCDDATA16), 6
#define S38C3                            BANKMASK(LCDDATA22), 6
#define S38C4                            BANKMASK(LCDDATA28), 6
#define S38C5                            BANKMASK(LCDDATA34), 6
#define S38C6                            BANKMASK(LCDDATA40), 6
#define S38C7                            BANKMASK(LCDDATA46), 6
#define S39C0                            BANKMASK(LCDDATA4), 7
#define S39C1                            BANKMASK(LCDDATA10), 7
#define S39C2                            BANKMASK(LCDDATA16), 7
#define S39C3                            BANKMASK(LCDDATA22), 7
#define S39C4                            BANKMASK(LCDDATA28), 7
#define S39C5                            BANKMASK(LCDDATA34), 7
#define S39C6                            BANKMASK(LCDDATA40), 7
#define S39C7                            BANKMASK(LCDDATA46), 7
#define S40C0                            BANKMASK(LCDDATA5), 0
#define S40C1                            BANKMASK(LCDDATA11), 0
#define S40C2                            BANKMASK(LCDDATA17), 0
#define S40C3                            BANKMASK(LCDDATA23), 0
#define S40C4                            BANKMASK(LCDDATA29), 0
#define S40C5                            BANKMASK(LCDDATA35), 0
#define S40C6                            BANKMASK(LCDDATA41), 0
#define S40C7                            BANKMASK(LCDDATA47), 0
#define S41C0                            BANKMASK(LCDDATA5), 1
#define S41C1                            BANKMASK(LCDDATA11), 1
#define S41C2                            BANKMASK(LCDDATA17), 1
#define S41C3                            BANKMASK(LCDDATA23), 1
#define S41C4                            BANKMASK(LCDDATA29), 1
#define S41C5                            BANKMASK(LCDDATA35), 1
#define S41C6                            BANKMASK(LCDDATA41), 1
#define S41C7                            BANKMASK(LCDDATA47), 1
#define S42C0                            BANKMASK(LCDDATA5), 2
#define S42C1                            BANKMASK(LCDDATA11), 2
#define S42C2                            BANKMASK(LCDDATA17), 2
#define S42C3                            BANKMASK(LCDDATA23), 2
#define S42C4                            BANKMASK(LCDDATA29), 2
#define S42C5                            BANKMASK(LCDDATA35), 2
#define S42C6                            BANKMASK(LCDDATA41), 2
#define S42C7                            BANKMASK(LCDDATA47), 2
#define S43C0                            BANKMASK(LCDDATA5), 3
#define S43C1                            BANKMASK(LCDDATA11), 3
#define S43C2                            BANKMASK(LCDDATA17), 3
#define S43C3                            BANKMASK(LCDDATA23), 3
#define S43C4                            BANKMASK(LCDDATA29), 3
#define S43C5                            BANKMASK(LCDDATA35), 3
#define S43C6                            BANKMASK(LCDDATA41), 3
#define S43C7                            BANKMASK(LCDDATA47), 3
#define S44C0                            BANKMASK(LCDDATA5), 4
#define S44C1                            BANKMASK(LCDDATA11), 4
#define S44C2                            BANKMASK(LCDDATA17), 4
#define S44C3                            BANKMASK(LCDDATA23), 4
#define S44C4                            BANKMASK(LCDDATA29), 4
#define S44C5                            BANKMASK(LCDDATA35), 4
#define S44C6                            BANKMASK(LCDDATA41), 4
#define S44C7                            BANKMASK(LCDDATA47), 4
#define S45C0                            BANKMASK(LCDDATA5), 5
#define S45C1                            BANKMASK(LCDDATA11), 5
#define S45C2                            BANKMASK(LCDDATA17), 5
#define S45C3                            BANKMASK(LCDDATA23), 5
#define S45C4                            BANKMASK(LCDDATA29), 5
#define S45C5                            BANKMASK(LCDDATA35), 5
#define S45C6                            BANKMASK(LCDDATA41), 5
#define S45C7                            BANKMASK(LCDDATA47), 5
#define SBCDE                            BANKMASK(SSP1CON3), 2
#define SBOREN                           BANKMASK(BORCON), 7
#define SCIE                             BANKMASK(SSP1CON3), 5
#define SDAHT                            BANKMASK(SSP1CON3), 3
#define SE00                             BANKMASK(LCDSE0), 0
#define SE01                             BANKMASK(LCDSE0), 1
#define SE02                             BANKMASK(LCDSE0), 2
#define SE03                             BANKMASK(LCDSE0), 3
#define SE04                             BANKMASK(LCDSE0), 4
#define SE05                             BANKMASK(LCDSE0), 5
#define SE06                             BANKMASK(LCDSE0), 6
#define SE07                             BANKMASK(LCDSE0), 7
#define SE08                             BANKMASK(LCDSE1), 0
#define SE09                             BANKMASK(LCDSE1), 1
#define SE10                             BANKMASK(LCDSE1), 2
#define SE11                             BANKMASK(LCDSE1), 3
#define SE12                             BANKMASK(LCDSE1), 4
#define SE13                             BANKMASK(LCDSE1), 5
#define SE14                             BANKMASK(LCDSE1), 6
#define SE15                             BANKMASK(LCDSE1), 7
#define SE16                             BANKMASK(LCDSE2), 0
#define SE17                             BANKMASK(LCDSE2), 1
#define SE18                             BANKMASK(LCDSE2), 2
#define SE19                             BANKMASK(LCDSE2), 3
#define SE20                             BANKMASK(LCDSE2), 4
#define SE21                             BANKMASK(LCDSE2), 5
#define SE22                             BANKMASK(LCDSE2), 6
#define SE23                             BANKMASK(LCDSE2), 7
#define SE24                             BANKMASK(LCDSE3), 0
#define SE25                             BANKMASK(LCDSE3), 1
#define SE26                             BANKMASK(LCDSE3), 2
#define SE27                             BANKMASK(LCDSE3), 3
#define SE28                             BANKMASK(LCDSE3), 4
#define SE29                             BANKMASK(LCDSE3), 5
#define SE30                             BANKMASK(LCDSE3), 6
#define SE31                             BANKMASK(LCDSE3), 7
#define SE32                             BANKMASK(LCDSE4), 0
#define SE33                             BANKMASK(LCDSE4), 1
#define SE34                             BANKMASK(LCDSE4), 2
#define SE35                             BANKMASK(LCDSE4), 3
#define SE36                             BANKMASK(LCDSE4), 4
#define SE37                             BANKMASK(LCDSE4), 5
#define SE38                             BANKMASK(LCDSE4), 6
#define SE39                             BANKMASK(LCDSE4), 7
#define SE40                             BANKMASK(LCDSE5), 0
#define SE41                             BANKMASK(LCDSE5), 1
#define SE42                             BANKMASK(LCDSE5), 2
#define SE43                             BANKMASK(LCDSE5), 3
#define SE44                             BANKMASK(LCDSE5), 4
#define SE45                             BANKMASK(LCDSE5), 5
#define SE46                             BANKMASK(LCDSE5), 6
#define SE47                             BANKMASK(LCDSE5), 7
#define SECH0                            BANKMASK(SECONDS), 4
#define SECH1                            BANKMASK(SECONDS), 5
#define SECH2                            BANKMASK(SECONDS), 6
#define SECL0                            BANKMASK(SECONDS), 0
#define SECL1                            BANKMASK(SECONDS), 1
#define SECL2                            BANKMASK(SECONDS), 2
#define SECL3                            BANKMASK(SECONDS), 3
#define SEN1                             BANKMASK(SSP1CON2), 0
#define SHUTDOWN                         BANKMASK(CWG1AS0), 7
#define SLPEN                            BANKMASK(LCDCON), 6
#define SLRA0                            BANKMASK(SLRCONA), 0
#define SLRA1                            BANKMASK(SLRCONA), 1
#define SLRA2                            BANKMASK(SLRCONA), 2
#define SLRA3                            BANKMASK(SLRCONA), 3
#define SLRA4                            BANKMASK(SLRCONA), 4
#define SLRA6                            BANKMASK(SLRCONA), 6
#define SLRA7                            BANKMASK(SLRCONA), 7
#define SLRB0                            BANKMASK(SLRCONB), 0
#define SLRB1                            BANKMASK(SLRCONB), 1
#define SLRB2                            BANKMASK(SLRCONB), 2
#define SLRB3                            BANKMASK(SLRCONB), 3
#define SLRB4                            BANKMASK(SLRCONB), 4
#define SLRB5                            BANKMASK(SLRCONB), 5
#define SLRB6                            BANKMASK(SLRCONB), 6
#define SLRB7                            BANKMASK(SLRCONB), 7
#define SLRC0                            BANKMASK(SLRCONC), 0
#define SLRC1                            BANKMASK(SLRCONC), 1
#define SLRC2                            BANKMASK(SLRCONC), 2
#define SLRC3                            BANKMASK(SLRCONC), 3
#define SLRC4                            BANKMASK(SLRCONC), 4
#define SLRC5                            BANKMASK(SLRCONC), 5
#define SLRC6                            BANKMASK(SLRCONC), 6
#define SLRC7                            BANKMASK(SLRCONC), 7
#define SLRD0                            BANKMASK(SLRCOND), 0
#define SLRD1                            BANKMASK(SLRCOND), 1
#define SLRD2                            BANKMASK(SLRCOND), 2
#define SLRD3                            BANKMASK(SLRCOND), 3
#define SLRD4                            BANKMASK(SLRCOND), 4
#define SLRD5                            BANKMASK(SLRCOND), 5
#define SLRD6                            BANKMASK(SLRCOND), 6
#define SLRD7                            BANKMASK(SLRCOND), 7
#define SLRE0                            BANKMASK(SLRCONE), 0
#define SLRE1                            BANKMASK(SLRCONE), 1
#define SLRE3                            BANKMASK(SLRCONE), 3
#define SLRE4                            BANKMASK(SLRCONE), 4
#define SLRE5                            BANKMASK(SLRCONE), 5
#define SLRE6                            BANKMASK(SLRCONE), 6
#define SLRE7                            BANKMASK(SLRCONE), 7
#define SLRF0                            BANKMASK(SLRCONF), 0
#define SLRF1                            BANKMASK(SLRCONF), 1
#define SLRF2                            BANKMASK(SLRCONF), 2
#define SLRF3                            BANKMASK(SLRCONF), 3
#define SLRF4                            BANKMASK(SLRCONF), 4
#define SLRF5                            BANKMASK(SLRCONF), 5
#define SLRF6                            BANKMASK(SLRCONF), 6
#define SLRF7                            BANKMASK(SLRCONF), 7
#define SLRG0                            BANKMASK(SLRCONG), 0
#define SLRG1                            BANKMASK(SLRCONG), 1
#define SLRG2                            BANKMASK(SLRCONG), 2
#define SLRG3                            BANKMASK(SLRCONG), 3
#define SLRG4                            BANKMASK(SLRCONG), 4
#define SLRG6                            BANKMASK(SLRCONG), 6
#define SLRG7                            BANKMASK(SLRCONG), 7
#define SLRH0                            BANKMASK(SLRCONH), 0
#define SLRH1                            BANKMASK(SLRCONH), 1
#define SLRH2                            BANKMASK(SLRCONH), 2
#define SLRH3                            BANKMASK(SLRCONH), 3
#define SMP                              BANKMASK(SSP1STAT), 7
#define SMP1                             BANKMASK(SSP1STAT), 7
#define SMT1AS                           BANKMASK(SMT1STAT), 0
#define SMT1CPR10                        BANKMASK(SMT1CPRH), 2
#define SMT1CPR11                        BANKMASK(SMT1CPRH), 3
#define SMT1CPR12                        BANKMASK(SMT1CPRH), 4
#define SMT1CPR13                        BANKMASK(SMT1CPRH), 5
#define SMT1CPR14                        BANKMASK(SMT1CPRH), 6
#define SMT1CPR15                        BANKMASK(SMT1CPRH), 7
#define SMT1CPR16                        BANKMASK(SMT1CPRU), 0
#define SMT1CPR17                        BANKMASK(SMT1CPRU), 1
#define SMT1CPR18                        BANKMASK(SMT1CPRU), 2
#define SMT1CPR19                        BANKMASK(SMT1CPRU), 3
#define SMT1CPR20                        BANKMASK(SMT1CPRU), 4
#define SMT1CPR21                        BANKMASK(SMT1CPRU), 5
#define SMT1CPR22                        BANKMASK(SMT1CPRU), 6
#define SMT1CPR23                        BANKMASK(SMT1CPRU), 7
#define SMT1CPR8                         BANKMASK(SMT1CPRH), 0
#define SMT1CPR9                         BANKMASK(SMT1CPRH), 1
#define SMT1CPRUP                        BANKMASK(SMT1STAT), 7
#define SMT1CPW0                         BANKMASK(SMT1CPWL), 0
#define SMT1CPW1                         BANKMASK(SMT1CPWL), 1
#define SMT1CPW10                        BANKMASK(SMT1CPWH), 2
#define SMT1CPW11                        BANKMASK(SMT1CPWH), 3
#define SMT1CPW12                        BANKMASK(SMT1CPWH), 4
#define SMT1CPW13                        BANKMASK(SMT1CPWH), 5
#define SMT1CPW14                        BANKMASK(SMT1CPWH), 6
#define SMT1CPW15                        BANKMASK(SMT1CPWH), 7
#define SMT1CPW16                        BANKMASK(SMT1CPWU), 0
#define SMT1CPW17                        BANKMASK(SMT1CPWU), 1
#define SMT1CPW18                        BANKMASK(SMT1CPWU), 2
#define SMT1CPW19                        BANKMASK(SMT1CPWU), 3
#define SMT1CPW2                         BANKMASK(SMT1CPWL), 2
#define SMT1CPW20                        BANKMASK(SMT1CPWU), 4
#define SMT1CPW21                        BANKMASK(SMT1CPWU), 5
#define SMT1CPW22                        BANKMASK(SMT1CPWU), 6
#define SMT1CPW23                        BANKMASK(SMT1CPWU), 7
#define SMT1CPW3                         BANKMASK(SMT1CPWL), 3
#define SMT1CPW4                         BANKMASK(SMT1CPWL), 4
#define SMT1CPW5                         BANKMASK(SMT1CPWL), 5
#define SMT1CPW6                         BANKMASK(SMT1CPWL), 6
#define SMT1CPW7                         BANKMASK(SMT1CPWL), 7
#define SMT1CPW8                         BANKMASK(SMT1CPWH), 0
#define SMT1CPW9                         BANKMASK(SMT1CPWH), 1
#define SMT1CPWUP                        BANKMASK(SMT1STAT), 6
#define SMT1CSEL0                        BANKMASK(SMT1CLK), 0
#define SMT1CSEL1                        BANKMASK(SMT1CLK), 1
#define SMT1CSEL2                        BANKMASK(SMT1CLK), 2
#define SMT1EN                           BANKMASK(SMT1CON0), 7
#define SMT1GO                           BANKMASK(SMT1CON1), 7
#define SMT1IE                           BANKMASK(PIE8), 0
#define SMT1IF                           BANKMASK(PIR8), 0
#define SMT1MD                           BANKMASK(PMD5), 6
#define SMT1PR0                          BANKMASK(SMT1PRL), 0
#define SMT1PR1                          BANKMASK(SMT1PRL), 1
#define SMT1PR10                         BANKMASK(SMT1PRH), 2
#define SMT1PR11                         BANKMASK(SMT1PRH), 3
#define SMT1PR12                         BANKMASK(SMT1PRH), 4
#define SMT1PR13                         BANKMASK(SMT1PRH), 5
#define SMT1PR14                         BANKMASK(SMT1PRH), 6
#define SMT1PR15                         BANKMASK(SMT1PRH), 7
#define SMT1PR16                         BANKMASK(SMT1PRU), 0
#define SMT1PR17                         BANKMASK(SMT1PRU), 1
#define SMT1PR18                         BANKMASK(SMT1PRU), 2
#define SMT1PR19                         BANKMASK(SMT1PRU), 3
#define SMT1PR2                          BANKMASK(SMT1PRL), 2
#define SMT1PR20                         BANKMASK(SMT1PRU), 4
#define SMT1PR21                         BANKMASK(SMT1PRU), 5
#define SMT1PR22                         BANKMASK(SMT1PRU), 6
#define SMT1PR23                         BANKMASK(SMT1PRU), 7
#define SMT1PR3                          BANKMASK(SMT1PRL), 3
#define SMT1PR4                          BANKMASK(SMT1PRL), 4
#define SMT1PR5                          BANKMASK(SMT1PRL), 5
#define SMT1PR6                          BANKMASK(SMT1PRL), 6
#define SMT1PR7                          BANKMASK(SMT1PRL), 7
#define SMT1PR8                          BANKMASK(SMT1PRH), 0
#define SMT1PR9                          BANKMASK(SMT1PRH), 1
#define SMT1PRAIE                        BANKMASK(PIE8), 1
#define SMT1PRAIF                        BANKMASK(PIR8), 1
#define SMT1PS0                          BANKMASK(SMT1CON0), 0
#define SMT1PS1                          BANKMASK(SMT1CON0), 1
#define SMT1PWAIE                        BANKMASK(PIE8), 2
#define SMT1PWAIF                        BANKMASK(PIR8), 2
#define SMT1RESET                        BANKMASK(SMT1STAT), 5
#define SMT1SIGPPS0                      BANKMASK(SMT1SIGPPS), 0
#define SMT1SIGPPS1                      BANKMASK(SMT1SIGPPS), 1
#define SMT1SIGPPS2                      BANKMASK(SMT1SIGPPS), 2
#define SMT1SIGPPS3                      BANKMASK(SMT1SIGPPS), 3
#define SMT1SIGPPS4                      BANKMASK(SMT1SIGPPS), 4
#define SMT1SSEL0                        BANKMASK(SMT1SIG), 0
#define SMT1SSEL1                        BANKMASK(SMT1SIG), 1
#define SMT1SSEL2                        BANKMASK(SMT1SIG), 2
#define SMT1SSEL3                        BANKMASK(SMT1SIG), 3
#define SMT1SSEL4                        BANKMASK(SMT1SIG), 4
#define SMT1TMR0                         BANKMASK(SMT1TMRL), 0
#define SMT1TMR1                         BANKMASK(SMT1TMRL), 1
#define SMT1TMR10                        BANKMASK(SMT1TMRH), 2
#define SMT1TMR11                        BANKMASK(SMT1TMRH), 3
#define SMT1TMR12                        BANKMASK(SMT1TMRH), 4
#define SMT1TMR13                        BANKMASK(SMT1TMRH), 5
#define SMT1TMR14                        BANKMASK(SMT1TMRH), 6
#define SMT1TMR15                        BANKMASK(SMT1TMRH), 7
#define SMT1TMR16                        BANKMASK(SMT1TMRU), 0
#define SMT1TMR17                        BANKMASK(SMT1TMRU), 1
#define SMT1TMR18                        BANKMASK(SMT1TMRU), 2
#define SMT1TMR19                        BANKMASK(SMT1TMRU), 3
#define SMT1TMR2                         BANKMASK(SMT1TMRL), 2
#define SMT1TMR20                        BANKMASK(SMT1TMRU), 4
#define SMT1TMR21                        BANKMASK(SMT1TMRU), 5
#define SMT1TMR22                        BANKMASK(SMT1TMRU), 6
#define SMT1TMR23                        BANKMASK(SMT1TMRU), 7
#define SMT1TMR3                         BANKMASK(SMT1TMRL), 3
#define SMT1TMR4                         BANKMASK(SMT1TMRL), 4
#define SMT1TMR5                         BANKMASK(SMT1TMRL), 5
#define SMT1TMR6                         BANKMASK(SMT1TMRL), 6
#define SMT1TMR7                         BANKMASK(SMT1TMRL), 7
#define SMT1TMR8                         BANKMASK(SMT1TMRH), 0
#define SMT1TMR9                         BANKMASK(SMT1TMRH), 1
#define SMT1TS                           BANKMASK(SMT1STAT), 2
#define SMT1WINPPS0                      BANKMASK(SMT1WINPPS), 0
#define SMT1WINPPS1                      BANKMASK(SMT1WINPPS), 1
#define SMT1WINPPS2                      BANKMASK(SMT1WINPPS), 2
#define SMT1WINPPS3                      BANKMASK(SMT1WINPPS), 3
#define SMT1WINPPS4                      BANKMASK(SMT1WINPPS), 4
#define SMT1WS                           BANKMASK(SMT1STAT), 1
#define SMT1WSEL0                        BANKMASK(SMT1WIN), 0
#define SMT1WSEL1                        BANKMASK(SMT1WIN), 1
#define SMT1WSEL2                        BANKMASK(SMT1WIN), 2
#define SMT1WSEL3                        BANKMASK(SMT1WIN), 3
#define SMT1WSEL4                        BANKMASK(SMT1WIN), 4
#define SOI                              BANKMASK(ADCON3), 3
#define SOR                              BANKMASK(OSCSTAT), 3
#define SOSCEN                           BANKMASK(OSCEN), 3
#define SOSCPWR                          BANKMASK(OSCCON3), 6
#define SPOL                             BANKMASK(SMT1CON0), 3
#define SSEL0                            BANKMASK(SMT1SIG), 0
#define SSEL1                            BANKMASK(SMT1SIG), 1
#define SSEL2                            BANKMASK(SMT1SIG), 2
#define SSEL3                            BANKMASK(SMT1SIG), 3
#define SSEL4                            BANKMASK(SMT1SIG), 4
#define SSP1CLKPPS0                      BANKMASK(SSP1CLKPPS), 0
#define SSP1CLKPPS1                      BANKMASK(SSP1CLKPPS), 1
#define SSP1CLKPPS2                      BANKMASK(SSP1CLKPPS), 2
#define SSP1CLKPPS3                      BANKMASK(SSP1CLKPPS), 3
#define SSP1CLKPPS4                      BANKMASK(SSP1CLKPPS), 4
#define SSP1DATPPS0                      BANKMASK(SSP1DATPPS), 0
#define SSP1DATPPS1                      BANKMASK(SSP1DATPPS), 1
#define SSP1DATPPS2                      BANKMASK(SSP1DATPPS), 2
#define SSP1DATPPS3                      BANKMASK(SSP1DATPPS), 3
#define SSP1DATPPS4                      BANKMASK(SSP1DATPPS), 4
#define SSP1IE                           BANKMASK(PIE3), 0
#define SSP1IF                           BANKMASK(PIR3), 0
#define SSP1SSPPS0                       BANKMASK(SSP1SSPPS), 0
#define SSP1SSPPS1                       BANKMASK(SSP1SSPPS), 1
#define SSP1SSPPS2                       BANKMASK(SSP1SSPPS), 2
#define SSP1SSPPS3                       BANKMASK(SSP1SSPPS), 3
#define SSP1SSPPS4                       BANKMASK(SSP1SSPPS), 4
#define SSPEN                            BANKMASK(SSP1CON1), 5
#define SSPEN1                           BANKMASK(SSP1CON1), 5
#define SSPM0                            BANKMASK(SSP1CON1), 0
#define SSPM01                           BANKMASK(SSP1CON1), 0
#define SSPM1                            BANKMASK(SSP1CON1), 1
#define SSPM11                           BANKMASK(SSP1CON1), 1
